## Terraform Plan

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.yandex_compute_instance_group.k8s_master will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_compute_instance_group" "k8s_master" {
      + allocation_policy            = (known after apply)
      + application_balancer_state   = (known after apply)
      + application_load_balancer    = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + deploy_policy                = (known after apply)
      + description                  = (known after apply)
      + folder_id                    = (known after apply)
      + health_check                 = (known after apply)
      + id                           = (known after apply)
      + instance_group_id            = (known after apply)
      + instance_template            = (known after apply)
      + instances                    = (known after apply)
      + labels                       = (known after apply)
      + load_balancer                = (known after apply)
      + load_balancer_state          = (known after apply)
      + max_checking_health_duration = (known after apply)
      + name                         = (known after apply)
      + scale_policy                 = (known after apply)
      + service_account_id           = (known after apply)
      + status                       = (known after apply)
      + variables                    = (known after apply)
    }

  # data.yandex_compute_instance_group.k8s_worker will be read during apply
  # (config refers to values not yet known)
 <= data "yandex_compute_instance_group" "k8s_worker" {
      + allocation_policy            = (known after apply)
      + application_balancer_state   = (known after apply)
      + application_load_balancer    = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + deploy_policy                = (known after apply)
      + description                  = (known after apply)
      + folder_id                    = (known after apply)
      + health_check                 = (known after apply)
      + id                           = (known after apply)
      + instance_group_id            = (known after apply)
      + instance_template            = (known after apply)
      + instances                    = (known after apply)
      + labels                       = (known after apply)
      + load_balancer                = (known after apply)
      + load_balancer_state          = (known after apply)
      + max_checking_health_duration = (known after apply)
      + name                         = (known after apply)
      + scale_policy                 = (known after apply)
      + service_account_id           = (known after apply)
      + status                       = (known after apply)
      + variables                    = (known after apply)
    }

  # module.ansible_inventory_file.yandex_storage_object.storage_object will be created
  + resource "yandex_storage_object" "storage_object" {
      + acl          = "private"
      + bucket       = "diplom-bucket"
      + content      = (sensitive value)
      + content_type = "application/octet-stream"
      + id           = (known after apply)
      + key          = "ansible/inventory/generated_yc.yml"
    }

  # module.bastion.yandex_compute_instance.vm will be created
  + resource "yandex_compute_instance" "vm" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = "bastion"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = "unspecified"
      + metadata                  = {
          + "user-data" = (sensitive value)
        }
      + name                      = "bastion"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v2"
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8hjrk74m4jvmvl5gi6"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = (known after apply)
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # module.bastion_sg.yandex_vpc_security_group.security_group will be created
  + resource "yandex_vpc_security_group" "security_group" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "bastion-sg"
      + network_id = (known after apply)
      + status     = (known after apply)

      + egress {
          + description       = "from bastion to internal subnets"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "10.10.10.0/24",
              + "10.10.11.0/24",
              + "10.10.12.0/24",
              + "10.10.20.0/24",
              + "10.10.21.0/24",
              + "10.10.22.0/24",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "from Internet to bastion"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 54231
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "109.252.11.88/32",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "from internal subnets to bastion"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "10.10.10.0/24",
              + "10.10.11.0/24",
              + "10.10.12.0/24",
              + "10.10.20.0/24",
              + "10.10.21.0/24",
              + "10.10.22.0/24",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.container_registry.yandex_container_registry.container_registry will be created
  + resource "yandex_container_registry" "container_registry" {
      + created_at  = (known after apply)
      + folder_id   = (known after apply)
      + id          = (known after apply)
      + labels      = (known after apply)
      + name        = "diplom-cr"
      + registry_id = (known after apply)
      + status      = (known after apply)
    }

  # module.k8s_manage_alb.yandex_alb_load_balancer.lb_app will be created
  + resource "yandex_alb_load_balancer" "lb_app" {
      + created_at   = (known after apply)
      + folder_id    = (known after apply)
      + id           = (known after apply)
      + log_group_id = (known after apply)
      + name         = "k8s-manage-alb"
      + network_id   = (known after apply)
      + status       = (known after apply)

      + allocation_policy {
          + location {
              + disable_traffic = false
              + subnet_id       = (known after apply)
              + zone_id         = "ru-central1-a"
            }
          + location {
              + disable_traffic = false
              + subnet_id       = (known after apply)
              + zone_id         = "ru-central1-b"
            }
          + location {
              + disable_traffic = false
              + subnet_id       = (known after apply)
              + zone_id         = "ru-central1-d"
            }
        }

      + listener {
          + name = "k8s-manage-alb-listener"

          + endpoint {
              + ports = [
                  + 6443,
                ]

              + address {
                  + internal_ipv4_address {
                      + address   = "10.10.20.10"
                      + subnet_id = (known after apply)
                    }
                }
            }

          + stream {
              + handler {
                  + backend_group_id = (known after apply)
                }
            }
        }
    }

  # module.k8s_manage_alb_backend_group.yandex_alb_backend_group.alb_backend_group will be created
  + resource "yandex_alb_backend_group" "alb_backend_group" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "k8s-alb-bg"

      + stream_backend {
          + enable_proxy_protocol                   = false
          + keep_connections_on_host_health_failure = false
          + name                                    = "k8s-alb-bg-stream"
          + port                                    = 6443
          + target_group_ids                        = (known after apply)
          + weight                                  = 1

          + healthcheck {
              + healthcheck_port = 6443
              + interval         = "1s"
              + timeout          = "1s"

              + stream_healthcheck {}
            }

          + load_balancing_config {
              + mode = "ROUND_ROBIN"
            }
        }
    }

  # module.k8s_master.yandex_compute_instance_group.vm_group will be created
  + resource "yandex_compute_instance_group" "vm_group" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + instances           = (known after apply)
      + labels              = {
          + "k8s_node_role" = "k8s_master"
        }
      + name                = "k8s-master"
      + service_account_id  = (sensitive value)
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
              + "ru-central1-d",
            ]
        }

      + application_load_balancer {
          + ignore_health_checks = true
          + status_message       = (known after apply)
          + target_group_id      = (known after apply)
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = "proactive"
        }

      + health_check {
          + healthy_threshold   = 2
          + interval            = 2
          + timeout             = 1
          + unhealthy_threshold = 2

          + tcp_options {
              + port = 22
            }
        }

      + instance_template {
          + hostname    = "k8s-master-{instance.index}"
          + labels      = {
              + "k8s_node_role" = "k8s_master"
            }
          + metadata    = {
              + "user-data" = (sensitive value)
            }
          + name        = "k8s-master-{instance.index}"
          + platform_id = "standard-v2"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd8hjrk74m4jvmvl5gi6"
                  + size        = 10
                  + snapshot_id = (known after apply)
                  + type        = "network-hdd"
                }
            }

          + metadata_options (known after apply)

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = false
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 20
              + cores         = 2
              + memory        = 2
            }

          + scheduling_policy (known after apply)
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.k8s_service_lb.yandex_lb_network_load_balancer.lb_network will be created
  + resource "yandex_lb_network_load_balancer" "lb_network" {
      + allow_zonal_shift   = (known after apply)
      + created_at          = (known after apply)
      + deletion_protection = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "k8s-service-lb"
      + region_id           = (known after apply)
      + type                = "external"

      + attached_target_group {
          + target_group_id = (known after apply)

          + healthcheck {
              + healthy_threshold   = 2
              + interval            = 2
              + name                = "k8s-service-lb-healthcheck"
              + timeout             = 1
              + unhealthy_threshold = 2

              + tcp_options {
                  + port = 10250
                }
            }
        }

      + listener {
          + name        = "k8s-service-lb-listener"
          + port        = 80
          + protocol    = "tcp"
          + target_port = 31280

          + external_address_spec {
              + address    = (known after apply)
              + ip_version = "ipv4"
            }
        }
    }

  # module.k8s_worker.yandex_compute_instance_group.vm_group will be created
  + resource "yandex_compute_instance_group" "vm_group" {
      + created_at          = (known after apply)
      + deletion_protection = false
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + instances           = (known after apply)
      + labels              = {
          + "k8s_node_role" = "k8s_worker"
        }
      + name                = "k8s-worker"
      + service_account_id  = (sensitive value)
      + status              = (known after apply)

      + allocation_policy {
          + zones = [
              + "ru-central1-a",
              + "ru-central1-b",
              + "ru-central1-d",
            ]
        }

      + deploy_policy {
          + max_creating     = 0
          + max_deleting     = 0
          + max_expansion    = 0
          + max_unavailable  = 1
          + startup_duration = 0
          + strategy         = "proactive"
        }

      + health_check {
          + healthy_threshold   = 2
          + interval            = 2
          + timeout             = 1
          + unhealthy_threshold = 2

          + tcp_options {
              + port = 22
            }
        }

      + instance_template {
          + hostname    = "k8s-worker-{instance.index}"
          + labels      = {
              + "k8s_node_role" = "k8s_worker"
            }
          + metadata    = {
              + "user-data" = (sensitive value)
            }
          + name        = "k8s-worker-{instance.index}"
          + platform_id = "standard-v2"

          + boot_disk {
              + device_name = (known after apply)
              + mode        = "READ_WRITE"

              + initialize_params {
                  + image_id    = "fd8hjrk74m4jvmvl5gi6"
                  + size        = 10
                  + snapshot_id = (known after apply)
                  + type        = "network-hdd"
                }
            }

          + metadata_options (known after apply)

          + network_interface {
              + ip_address   = (known after apply)
              + ipv4         = true
              + ipv6         = (known after apply)
              + ipv6_address = (known after apply)
              + nat          = false
              + subnet_ids   = (known after apply)
            }

          + resources {
              + core_fraction = 20
              + cores         = 2
              + memory        = 2
            }

          + scheduling_policy (known after apply)
        }

      + load_balancer {
          + ignore_health_checks = true
          + status_message       = (known after apply)
          + target_group_id      = (known after apply)
        }

      + scale_policy {
          + fixed_scale {
              + size = 1
            }
        }
    }

  # module.nat_instance.yandex_compute_instance.vm will be created
  + resource "yandex_compute_instance" "vm" {
      + allow_stopping_for_update = true
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + gpu_cluster_id            = (known after apply)
      + hardware_generation       = (known after apply)
      + hostname                  = "nat-instance"
      + id                        = (known after apply)
      + maintenance_grace_period  = (known after apply)
      + maintenance_policy        = "unspecified"
      + metadata                  = {
          + "user-data" = (sensitive value)
        }
      + name                      = "nat-instance"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v2"
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8d631hhpuvbgn19i6o"
              + name        = (known after apply)
              + size        = 10
              + snapshot_id = (known after apply)
              + type        = "network-hdd"
            }
        }

      + metadata_options (known after apply)

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "10.10.10.10"
          + ipv4               = true
          + ipv6               = (known after apply)
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy (known after apply)

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # module.nat_instance_sg.yandex_vpc_security_group.security_group will be created
  + resource "yandex_vpc_security_group" "security_group" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "nat-instance-sg"
      + network_id = (known after apply)
      + status     = (known after apply)

      + egress {
          + description       = "from nat-instance to any"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "from internal subnets to nat-instance"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "10.10.10.0/24",
              + "10.10.11.0/24",
              + "10.10.12.0/24",
              + "10.10.20.0/24",
              + "10.10.21.0/24",
              + "10.10.22.0/24",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.to_nat_instance_route_table.yandex_vpc_route_table.route_table will be created
  + resource "yandex_vpc_route_table" "route_table" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "to-nat-instance-rt"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + next_hop_address   = "10.10.10.10"
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc_net.yandex_vpc_network.network will be created
  + resource "yandex_vpc_network" "network" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "diplom-vpc"
      + subnet_ids                = (known after apply)
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[0] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[1] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.11.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[2] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-d"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.12.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[3] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-a"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[4] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-b"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.21.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # module.vpc_subnet.yandex_vpc_subnet.subnet[5] will be created
  + resource "yandex_vpc_subnet" "subnet" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "private-d"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.22.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-d"
    }

Plan: 19 to add, 0 to change, 0 to destroy.

```

</details>